'''求和'''
def sum():
    row=0
    sum=0
    while row<100:
        row+=1
        sum = sum + row

    print(sum)

#--------------------------------------------------------------

'''
反转循环打印字符串”helloworld”
'''
def p():
    i='helloworld'
    print(i[::-1])

#--------------------------------------------------------------


'''
定义字符串line='I am a beautiful girl'，变化为：girl beautiful a am I
'''
def change():
    i = ['I', 'am', 'a', 'beautiful', 'girl']
    print(i[::-1])
    print(type(i))


#--------------------------------------------------------------


'''
定义字典元素的列表：stds_list= [
{"id": 1, "name": "小明", "c_s": 85, "python_s": 78},
{"id": 2, "name": "小花", "c_s": 69, "python_s": 88},
{"id": 3, "name": "小东", "c_s": 79, "python_s": 83},
]
显示学生信息：“学生id：1，学生姓名：小明，C语言成绩：85, Python成绩：78”。
'''
stds_list= [{"id": 1, "name": "小明", "c_s": 85, "python_s": 78},
            {"id": 2, "name": "小花", "c_s": 69, "python_s": 88},
            {"id": 3, "name": "小东", "c_s": 79, "python_s": 83}]
def prt():
    for i in stds_list:
        print('学生id:' + str(i["id"]) + ',学生姓名:' + i["name"] + ',C语言成绩:' + str(i["c_s"]) + ',Python成绩:' + str(
            i["python_s"]))

# print('学生id:' + str(stds_list[0]["id"]) + ',学生姓名:' + stds_list[0]["name"] + ',C语言成绩:' + str(stds_list[0]["c_s"]) + ',Python成绩:' + str(i["python_s"]))

#--------------------------------------------------------------


'''
输入一行字符,统计其中有多少个单词，每两个单词之间以空格隔开。
如输入: This is a Python program. 输出：There are 5 words in the line
'''
def calc() :
    i = str(input('请输入一行字符:'))
    li = i.split(" ")
    print(li)
    n = len(li)
    print(f'there are {n} words in the line')

#--------------------------------------------------------------
'''
* 提示用户输入姓名
* 然后输出 Hi + 姓名
'''
def a():
    name=input('请输入姓名:')
    print('HI'+name)
#--------------------------------------------------------------
'''
## 邮件机器人
* 假设计你是要给自动给客户发邮件的运营人员
* 提示运营人员输入姓名 
* 提示运营人输入购买的商品 
* 输出邮件格式如下：

Dear [用户姓名]:
    
    Your purchased product : [产品名] is delivered!
    
    Thanks for your choosing!
    
'''
def f():
    name=input('输入姓名:')
    product=input('输入购买的商品:')
    print(f'Dear {name}:\n'
          f'\tYour purchased product :{product} is delivered!\n'
          f'\tThanks for your choosing!')

#--------------------------------------------------------------

'''
## 截取字符串
从 "You Rise Me Up" 中截取 Rise
'''
def y():
    i='You Rise Me Up'
    li=i.split(' ')
    print(li)
    print(li[1])
#--------------------------------------------------------------


'''
## 字符串大小写转换
将 "Python Basic" 转成小写
'''
def xiaoxie():
    h="Python Basic"
    print(h.lower())
def daxie():
    h = "python basic"
    print(h.upper())

#--------------------------------------------------------------

'''
## 数值计算
* 计算 1000 乘以 2000，再减 1000000
* 打印出结果

'''
def calc1():
    i=1000
    p=2000
    c=100000
    print(i*p-c)

#--------------------------------------------------------------
'''
## 变量类型 (附加题，不考)
* 猜一下下面两行代码的执行结果：
* print(type(100))
* print(type("Hello"))

'''
#--------------------------------------------------------------


'''
题目：

* 在中国 1～3月为春季，4～6个月为夏季，7～9月为秋季，10～12月为冬季；
* 提示用户输入一个月份（数字），然后输出是什么季节；
* 如果用户输入 1～12 之外的数字，提示 "机器故障"。

  备注：因为是学习的第二天，所以暂时让用户输入，以后可以直接读系统中的日期


'''
def season():
    n=int(input('请输入月份:'))
    if 1<=n<=3:
        print('现在是春季')
    elif 4<=n<=6:
        print('现在是夏季')
    elif 7<=n<=9:
        print('现在是秋季')
    elif 10<=n<=12:
        print('现在是冬季')
    else:
        print('机器故障')
#--------------------------------------------------------------
'''
# 3. 价格预警机器人
* 假设你要监控  A,B,C 三个商品
* 如果 A/B/C 分别降价 30/20/10 元上，就要报警
* 提示用户输入商品名（A/B/C)
* 提示用户输入降价值 (数字）
* 如果需要报警则打印商品名 + 降价值

'''
def price():
    base = {'A':30,'B':20,'C':10}
    h=input('请输入商品名:').upper()
    c=int(input('请输入降值价格:'))
    if c > base[h]:
        print(f'{h}  +  {str(c)}')
#--------------------------------------------------------------

'''
---
题目：

* 假设你现在是考试院的老师，在看试卷，要打评语
* 提示用户输出考试分数（数字），分数范围是0 ~ 100 分
* 如果输入值小于 60 分，则打印 "要加油呀!"
* 如果输入值大于等于 60 分，且小于 80分，则打印 "不错呀，认真学习了！"
* 如果输入值大于等于 80 分，则打印 "考得不错，不要骄傲！"
* 不在 0～100 分范围内的输入，我不需要打印任何信息

  备注：因为是学习的第二天，所以暂时让用户输入，以后可以直接读取成绩表，直接出评语
  
---
解题讲解：

此题为2，3题的变体，故不再专门解释！

* 特别注意的是，本题不需要使用 else
* 在 if/elif 的组合里要考虑用户输入值不在 0~100 的情况

'''
def s():
    score=int(input('请输入考试分数:'))
    if score<60:
        print('要加油呀!')
    elif 60<=score<=80:
        print('不错呀，认真学习了！')
    elif 80<score<100:
        print('考得不错，不要骄傲！')
    else:
        pass
#--------------------------------------------------------------

'''
# 5. 智能空调机器人

---
题目：

* 假设你现在设计一台智能空调
* 提示用户输入季节（只能是 winter/summer)
* 提示用户输入当前温度 (数字）
* 如果季节是 winter， 且温度低于10度，则打印 "太冷了，开热空调了"
* 如果季节是 summer， 且温度高于27度，则打印 "太热了，开冷空调了"
* 如果是不符合上面条件的用户输入，则不用打印任何东西

  备注：因为是学习的第二天，所以暂时让用户输入，以后可以接外部温度电子器直接读
  
---
解题讲解：

此题为2，3题的变体，故不再专门解释！

特别注意的是，本题不需要使用 else

'''
def ss():
    s={'winter':10,'summer':27}
    h=input('请输入季节:')
    i=int(input('请输入当前温度:'))
    if i>s[h]:
        print('太冷了,开热空调了')
    elif i<s[h]:
        print('太热了，开冷空调了')
    else:
        pass
#--------------------------------------------------------------
